Repository: DonutsNL/glpisaml
Catalog: locales/*.po
Languages: fr, nl_nl

source: SAML exclusions
fr: Exclusions SAML
nl_nl: Saml uitzonderingen

source: Installed / not configured
fr: Installé / non configuré
nl_nl: Geïnstalleerd/niet geconfigureerd

source: If this is a valid ID. Please request your administrator to enable the 'debug' flag to expose the requested IdP config using this meta file
fr: S'il s'agit d'une pièce d'identité valide. Veuillez demander à votre administrateur d'activer l'indicateur « debug » pour exposer la configuration IdP demandée à l'aide de ce méta-fichier.
nl_nl: Als u om een geldige idp heeft verzocht. Vraag uw beheerder dan om de 'debug'-vlag in te schakelen zodat de gevraagde IdP-configuratie toegankelijk wordt met behulp van dit metabestand

source: Saml SSO applications
fr: applications SAML SSO
nl_nl: Saml SSO-applicaties

source: Excluded paths
fr: Chemins exclus
nl_nl: Uitgesloten bestanden

source: JIT import rules
fr: Règles d'importation JIT
nl_nl: JIT importeer regels

source: SAML providers
fr: Fournisseurs SAML

source: Agent contains
fr: L'agent contient
nl_nl: Agent-string bevat

source: Bypass SAML auth
fr: Contourner l'authentification SAML
nl_nl: SAML-authenticatie omzeilen

source: Url contains path or file
fr: L'URL contient le chemin ou le fichier
nl_nl: URL bevat pad of bestand

source: Client Agent performing the call
fr: Agent client effectuant l'appel
nl_nl: Clientagent die de aanroep uitvoert

source: To be excluded path
fr: Chemin à exclure
nl_nl: Uitgesloten pad

source: Could not load loginState
fr: Impossible de charger loginState
nl_nl: Kan de loginState niet laden

source: Could not update the loginState and therefor stopped the loginFlow for:
fr: Impossible de mettre à jour le loginState et a donc arrêté le loginFlow pour\ :
nl_nl: Kon de loginState niet bijwerken waardoor de loginFlow geforceerd is gestopt voor IdpId\:

source: Could not load loginState from database!
fr: Impossible de charger loginState à partir de la base de données !
nl_nl: Kon de loginState niet laden uit de database!

source: ⚠️ SP private key does not seem to match provided SP certificates modulus.
fr: ⚠️ La clé privée SP ne semble pas correspondre au module des certificats SP modulus.
nl_nl: ⚠️ De privésleutel van SP lijkt niet overeen te komen met de SP-modulus.

source: ⚠️ Will be defaulted to "No" because the provided SP certificate does not look valid!
fr: ⚠️ Sera défini par défaut sur "Non" car le certificat SP fourni ne semble pas valide !
nl_nl: ⚠️ Deze waarde wordt standaard ingesteld op "Nee" omdat het opgegeven SP-certificaat niet geldig is!

source: Successfully added new GlpiSaml configuration.
fr: Nouvelle configuration GlpiSaml ajoutée avec succès.
nl_nl: Nieuwe GlpiSaml-configuratie toegevoegd.

source: Unable to add new GlpiSaml configuration, please review error logging
fr: Impossible d'ajouter une nouvelle configuration GlpiSaml, veuillez consulter la journalisation des erreurs
nl_nl: Kan geen nieuwe GlpiSaml-configuratie toevoegen. Controleer het foutlogboek voor meer informatie.

source: Configuration invalid, please correct all ⭕ errors first
fr: Configuration invalide, veuillez d'abord corriger toutes les ⭕ erreurs
nl_nl: Configuratie ongeldig. Corrigeer eerst alle met "⭕" weergegeven fouten

source: Configuration updated successfully
fr: Configuration mise à jour avec succès
nl_nl: De configuratie is succesvol bijgewerkt

source: Configuration update failed, check your update rights or error logging
fr: Échec de la mise à jour de la configuration, vérifiez vos droits de mise à jour ou la journalisation des erreurs
nl_nl: Configuratie-update mislukt. Controleer uw updaterechten of foutregistratie

source: Configuration invalid please correct all ⭕ errors first
fr: Configuration invalide, veuillez d'abord corriger toutes les ⭕ erreurs
nl_nl: Configuratie ongeldig. Corrigeer eerst alle met "⭕" weergegeven fouten

source: Configuration deleted successfully
fr: Configuration supprimée avec succès
nl_nl: Configuratie succesvol verwijderd

source: Not allowed or error deleting SAML configuration!
fr: Non autorisé ou erreur lors de la suppression de la configuration SAML!
nl_nl: Niet toegestaan ​​of er is een fout opgetreden tijdens het verwijderen van SAML-configuratie!

source: Invalid request, redirecting back
fr: Demande invalide, redirection vers l'arrière
nl_nl: Ongeldig verzoek, u wordt terug verwezen

source: Yes
fr: Oui
nl_nl: Ja

source: No
fr: Non
nl_nl: Nee

source: Unspecified
fr: Indéterminée
nl_nl: Niet gespecificeerd

source: Email Address
fr: Adresse email
nl_nl: E-mailadres

source: Transient
fr: Transitoire

source: Persistent
fr: Persistante

source: PasswordProtectedTransport
fr: Transport protégé par mot de passe

source: Password
fr: Mot de passe

source: none
fr: aucune

source: Exact
fr: Exacte

source: Better
fr: Mieux
nl_nl: Beter

source: Unique identifier for this configuration
fr: Identifiant unique pour cette configuration
nl_nl: Unieke ID voor deze configuratie

source: This name is shown with the login button on the login page. Try to keep this name short en to the point.
fr: Ce nom est affiché avec le bouton de connexion sur la page de connexion. Essayez de garder ce nom court et précis.
nl_nl: De naam die wordt weergegeven bij de betreffende login-knop op de login-pagina. Probeer de naam daarom kort en bondig te houden.

source: ⭕ Name is a required field
fr: ⭕ Le nom est un champ obligatoire
nl_nl: ⭕ Naam is een verplicht veld

source: Setting this value with the expected domain.tld, for example: with "google.com" will allow a user to trigger this IDP by providing their whatever@[google.com] username in the default GLPI username field. Setting this field to: youruserdomain.tld or to nothing disables this feature. Be aware that in the current implementation, configuring this field will hide the IDP button from the login screen
fr: Définir cette valeur avec le domain.tld attendu, par exemple\: avec "google.com" permettra à un utilisateur de déclencher cet IDP en fournissant son nom d'utilisateur everything@[google.com] dans le champ de nom d'utilisateur GLPI par défaut. Définir ce champ sur \ : youruserdomain.tld ou sur rien désactive cette fonctionnalité. Sachez que dans l'implémentation actuelle, la configuration de ce champ masquera le bouton IDP de l'écran de connexion.
nl_nl: Stel deze waarde in met het verwachte domein in de gebruikersnaam, bijvoorbeeld: met "google.com". Door deze optie te configureren kan een gebruiker deze IDP activeren door hun gebruikersnaam pietje.puk@[google.com] op te geven GLPI-gebruikersnaamveld. Deze optie is uit te schakelen door dit veld te updaten naar: 'uwgebruikersdomein.tld' of met een lege waarde. Houd er rekening mee dat in de huidige implementatie, de IDP knop verborgen zal worden wanneer dit veld is geconfigureerd.

source: ⭕ Provided certificate does not like look a valid (base64 encoded) certificate
fr: ⭕ Le certificat fourni n'a pas l'air d'un certificat valide (codé en base64)
nl_nl: ⭕ Het opgevoerde certificaat ziet er niet uit als een geldig (base64-gecodeerd) certificaat

source: The base62 encoded x509 service provider certificate. Used to sign and encrypt messages send by the service provider to the identity provider. Required for most of the security options
fr: Le certificat du fournisseur de services x509 codé en base62. Utilisé pour signer et chiffrer les messages envoyés par le fournisseur de services au fournisseur d'identité. Requis pour la plupart des options de sécurité
nl_nl: Het base62-gecodeerde x509-serviceprovidercertificaat. Dit certificaat wordt gebruikt om berichten die naar de identiteitsprovider worden verstuurd te ondertekenen en te coderen. Dit certificaat is vereist om gebruik te kunnen maken van verschillende beveiligingsopties.

source: The base62 encoded x509 service providers private key. Should match the modulus of the provided X509 service provider certificate
fr: Clé privée du fournisseur de services x509 codée en base62. Doit correspondre au module du certificat du fournisseur de services X509 fourni
nl_nl: De met base64 gecodeerde privésleutel van de x509-serviceprovider. Moet overeenkomen met de modulus van de verstrekt X509-serviceprovidercertificaat

source: The Service Provider nameid format specifies the constraints on the name identifier to be used to represent the requested subject.
fr: Le format Nameid du fournisseur de services spécifie les contraintes sur l'identifiant de nom à utiliser pour représenter le sujet demandé.
nl_nl: Het nameid-formaat configuratie item specificeert welke formaat gebruikt moet worden voor de naam-ID.

source: Service provider name id is a required field
fr: L’identifiant du nom du fournisseur de services est un champ obligatoire
nl_nl: Naam-ID van serviceprovider is een verplicht veld

source: Identifier of the IdP entity which is an URL provided by the SAML2 Identity Provider (IdP)
fr: Identifiant de l'entité IdP qui est une URL fournie par le fournisseur d'identité (IdP) SAML2
nl_nl: De unieke identificator van de IdP-entiteit, veelal in de vorm van een URL die wordt verstrekt door de SAML2-identiteitsprovider (IdP)

source: ⭕ Identity provider entity id is a required field
fr: ⭕ L'identifiant de l'entité du fournisseur d'identité est un champ obligatoire
nl_nl: ⭕ Identiteitsprovider-entiteits-ID is een verplicht veld

source: ⭕ The IdP SSO URL is a required field!<br>
fr: ⭕ L'URL SSO de l'IdP est un champ obligatoire !<br>
nl_nl: ⭕ De IdP SSO-URL is een verplicht veld!<br>

source: ⭕ Invalid IdP SSO URL, use: scheme://host.domain.tld/path/
fr: ⭕ URL SSO IdP invalide, utilisez: schéma\://host.domain.tld/path/
nl_nl: ⭕ Ongeldige IdP SSO-URL, gebruik: schema://host.domain.tld/path/

source: Single Sign On Service endpoint of the IdP. URL Target of the IdP where the Authentication Request Message will be sent. OneLogin PHPSAML only supports the 'HTTP-redirect' binding for this endpoint.
fr: Point de terminaison du service d’authentification unique de l’IdP. URL cible de l’IdP où le message de demande d’authentification sera envoyé. OneLogin PHPSAML prend uniquement en charge la liaison « HTTP-redirect » pour ce point de terminaison.
nl_nl: Single Sign On Service-eindpunt van de IdP. Doel URL van de IdP waar het Authenticatieverzoekbericht naartoe wordt verzonden. Let op! OneLogin PHPSAML ondersteunt alleen de 'HTTP-redirect'-binding voor dit eindpunt.

source: ⭕ Invalid Idp SLO URL, use: scheme://host.domain.tld/path/
fr: ⭕ URL SLO Idp invalide, utilisez \ : schéma\://host.domain.tld/path/
nl_nl: ⭕ Ongeldige Idp SLO-URL, gebruik: schema://host.domain.tld/path/

source: Single Logout service endpoint of the IdP. URL Location of the IdP where SLO Request will be sent.OneLogin PHPSAML only supports the 'HTTP-redirect' binding for this endpoint.
fr: Point de terminaison du service de déconnexion unique de l’IdP. URL Emplacement de l'IdP où la demande SLO sera envoyée. OneLogin PHPSAML prend uniquement en charge la liaison « HTTP-redirect » pour ce point de terminaison.
nl_nl: Single Logout-service-eindpunt van de IdP. URL Locatie van de IdP waar het SLO-verzoek naartoe wordt verzonden. OneLogin PHPSAML ondersteunt alleen de 'HTTP-redirect'-binding voor dit eindpunt.

source: ⭕ Valid Idp X509 certificate is required! (base64 encoded)
fr: ⭕ Un certificat Idp X509 valide est requis ! (codé en base64)
nl_nl: ⭕ Een geldig Idp X509-certificaat is vereist! (base64 gecodeerd)

source: The Public Base64 encoded x509 certificate used by the IdP. Fingerprinting can be used, but is not recommended. Fingerprinting requires you to manually alter the Saml Config array located in ConfigEntity.php and provide the required configuration options
fr: Le certificat x509 codé en Base64 public utilisé par l'IdP. Les empreintes digitales peuvent être utilisées, mais elles ne sont pas recommandées. La prise d'empreintes digitales vous oblige à modifier manuellement le tableau Saml Config situé dans ConfigEntity.php et à fournir les options de configuration requises.
nl_nl: Het public Base64-gecodeerde x509-certificaat dat door de IdP wordt gebruikt. Vingerafdrukken kunnen worden gebruikt, maar worden niet aanbevolen. Voor vingerafdrukken moet u de Saml Config-array in ConfigEntity.php handmatig wijzigen en de vereiste configuratie-opties opgeven

source: Authentication context needs to be satisfied by the IdP in order to allow Saml login. Set to "none" and OneLogin PHPSAML will not send an AuthContext in the AuthNRequest. Or, select one or more options using the "control+click" combination.
fr: Le contexte d'authentification doit être satisfait par l'IdP afin de permettre la connexion Saml. Réglé sur "aucun" et OneLogin PHPSAML n'enverra pas d'AuthContext dans AuthNRequest. Ou sélectionnez une ou plusieurs options à l'aide de la combinaison "Ctrl+Clic".
nl_nl: Er moet aan de authenticatiecontext worden voldaan door de IdP om Saml-aanmelding mogelijk te maken. Als u deze instelt op 'none', verzendt OneLogin PHPSAML geen AuthContext in de AuthNRequest. Of selecteer een of meer opties met de combinatie "control+klik".

source: ⭕ Requested authN context is a required field
fr: ⭕ Le contexte d'authentification demandé est un champ obligatoire
nl_nl: ⭕ De gevraagde authN-context is een verplicht veld

source: AUTHN Comparison attribute value
fr: Valeur de l'attribut de comparaison AUTHN
nl_nl: AUTHN-vergelijkingskenmerkwaarde

source: ⭕ Requested authN context comparison is a required field
fr: ⭕ La comparaison du contexte d'authentification demandée est un champ obligatoire
nl_nl: ⭕ Gevraagde authN-contextvergelijking is een verplicht veld

source: The FontAwesome (https://fontawesome.com/) icon to show on the button on the login page.
fr: L'icône FontAwesome (https://fontawesome.com/') à afficher sur le bouton de la page de connexion.
nl_nl: Het FontAwesome-pictogram (https://fontawesome.com/) wordt weergegeven op de knop op de inlogpagina.

source: ⭕ Configuration icon is a required field
fr: ⭕ L'icône de configuration est un champ obligatoire
nl_nl: ⭕ Configuratiepictogram is een verplicht veld

source: The comments
fr: Les commentaires
nl_nl: Opmerkingen

source: The date this configuration item was created
fr: La date à laquelle cet élément de configuration a été créé
nl_nl: De datum waarop dit configuratie-item is gemaakt

source: The date this config was modified
fr: La date à laquelle cette configuration a été modifiée
nl_nl: De datum waarop deze configuratie is gewijzigd

source: Is this configuration marked as deleted by GLPI
fr: Cette configuration est-elle marquée comme supprimée par GLPI
nl_nl: Is deze configuratie gemarkeerd als verwijderd door GLPI

source: Indicates if this configuration activated. Disabled configurations cannot be used to login into GLPI and will NOT be shown on the login page.
fr: Indique si cette configuration est activée. Les configurations désactivées ne peuvent pas être utilisées pour se connecter à GLPI et ne seront PAS affichées sur la page de connexion.
nl_nl: Geeft aan of deze configuratie wel of niet is geactiveerd. Uitgeschakelde configuraties kunnen niet worden gebruikt om in te loggen bij GLPI en worden NIET weergegeven op de inlogpagina.

source: If enabled PHPSAML will replace the default GLPI login screen with a version that does not have the default GLPI login options and only allows the user to authenticate using the configured SAML2 idps. This setting can be bypassed using a bypass URI parameter
fr: S'il est activé, PHPSAML remplacera l'écran de connexion GLPI par défaut par une version qui ne dispose pas des options de connexion GLPI par défaut et permettra uniquement à l'utilisateur de s'authentifier à l'aide des identifiants SAML2 configurés. Ce paramètre peut être contourné à l'aide d'un paramètre URI de contournement
nl_nl: Indien ingeschakeld zal PHPSAML het standaard GLPI-inlogscherm vervangen door een versie die niet de standaard GLPI-inlogopties heeft en de gebruiker alleen in staat stelt zich te authentiseren met behulp van de geconfigureerde SAML2-idps. Deze instelling kan worden omzeild met behulp van een bypass-URI-parameter

source: Is GLPI positioned behind a proxy that alters the SAML response scheme?
fr: GLPI est-il positionné derrière un proxy qui modifie le schéma de réponse SAML ?
nl_nl: Staat GLPI achter een proxy die het SAML-reactieschema verandert?

source: If enabled the OneLogin PHPSAML Toolkit will reject unsigned or unencrypted messages if it expects them to be signed or encrypted. Also it will reject the messages if the SAML standard is not strictly followed: Destination, NameId, Conditions are validated too. Strongly advised in production environments.
fr: S'il est activé, le kit d'outils OneLogin PHPSAML rejettera les messages non signés ou non chiffrés s'il s'attend à ce qu'ils soient signés ou chiffrés. De plus, il rejettera les messages si le standard SAML n'est pas strictement suivi : Destination, NameId, Conditions sont également validées. Fortement conseillé dans les environnements de production.
nl_nl: Indien ingeschakeld zal de OneLogin PHPSAML Toolkit niet-ondertekende of niet-gecodeerde berichten weigeren als deze verwacht dat ze ondertekend of gecodeerd zijn. Ook worden de berichten afgewezen als de SAML-standaard niet strikt wordt gevolgd\: Destination, NameId en Terms zijn ook gevalideerd. Sterk aanbevolen in productieomgevingen.

source: ⚠️ Warning, do not use the 'withlove.from.donuts.nl' example certificates. They offer no additional protection.
fr: ⚠️ Attention, n'utilisez pas les exemples de certificats 'withlove.from.donuts.nl'. Ils n'offrent aucune protection supplémentaire.
nl_nl: ⚠️Waarschuwing, gebruik niet de ‘withlove.from.donuts.nl’ voorbeeldcertificaten. Dit certificaat biedt geen extra bescherming omdat de privésleutel bekend is.

source: ⭕ Certificate must be wrapped in valid BEGIN CERTIFICATE and END CERTIFICATE tags
fr: ⭕ Le certificat doit être enveloppé dans des balises BEGIN CERTIFICATE et END CERTIFICATE valides
nl_nl: ⭕ Het certificaat moet zijn omsloten in geldige BEGIN-CERTIFICATE- en END-CERTIFICATE-tags

source: ⭕ Certificate should not contain "carriage returns" [<CR>]
fr: ⭕ Le certificat ne doit pas contenir de « retours chariot » [<CR>]
nl_nl: ⭕ Certificaat mag geen "carriage return" [\<CR\>] bevatten

source: ⭕ No valid X509 certificate found
fr: ⭕ Aucun certificat X509 valide trouvé
nl_nl: ⭕ Geen geldig X509-certificaat gevonden

source: ⚠️ OpenSSL is not available, GLPI cant validate your certificate
fr: ⚠️ OpenSSL n'est pas disponible, GLPI ne peut pas valider votre certificat
nl_nl: ⚠️ OpenSSL is niet beschikbaar, als gevolg hiervan kan GLPI uw certificaat niet valideren

source: Unable to fetch idp configuration with id:
fr: Impossible de récupérer la configuration IDP avec id\ :
nl_nl: Kan idp-configuratie met het volgende ID niet ophalen:

source: Assert saml
fr: Affirmer saml
nl_nl: Controleer SAML

source: We did not receive the required POST/GET headers, see: https://codeberg.org/QuinQuies/glpisaml/wiki/ACS.php for more information
fr: Nous n'avons pas reçu les en-têtes POST/GET requis, voir\ : https://codeberg.org/QuinQuies/glpisaml/wiki/ACS.php pour plus d'informations
nl_nl: We hebben de vereiste POST/GET headers niet ontvangen, zie: https://codeberg.org/QuinQuies/glpisaml/wiki/ACS.php voor meer informatie

source: It looks like this samlResponse has already been used to authenticate a different user. Maybe an error occurred and you pressed F5 and accidently resend the samlResponse that is already registered as processed. For security reasons we can not allow processed samlResponses to be processed again. Please login again to generate a new samlResponse. Sorry for any inconvenience. If the problem presists, then please contact your administrator. See: https://codeberg.org/QuinQuies/glpisaml/wiki/LoginState.php for more information
fr: Il semble que cette samlResponse ait déjà été utilisée pour authentifier un autre utilisateur. Peut-être qu'une erreur s'est produite et que vous avez appuyé sur F5 et renvoyé accidentellement la samlResponse qui est déjà enregistrée comme traitée. Pour des raisons de sécurité, nous ne pouvons pas autoriser le traitement à nouveau des samlResponses traitées. Veuillez vous reconnecter pour générer une nouvelle samlResponse. Désolé pour tout inconvénient. Si le problème persiste, veuillez contacter votre administrateur. Voir\ : https://codeberg.org/QuinQuies/glpisaml/wiki/LoginState.php pour plus d'informations
nl_nl: Het lijkt erop dat deze samlResponse al is gebruikt om een ​​andere sessie te authenticeren. Misschien is er een fout opgetreden en hebt u per ongeluk op F5 gedrukt en daarmee de samlResponse opnieuw verzonden die reeds al als verwerkt is geregistreerd. Om veiligheidsredenen kunnen we echter niet toestaan ​​dat verwerkte samlResponses opnieuw worden verwerkt. Meldt u daarom opnieuw aan om zo een ​​nieuwe samlResponse te genereren. Excuses voor het ongemak. Als het probleem zich blijft voordoen, neem dan contact op met uw beheerder. Zie: https://codeberg.org/QuinQuies/glpisaml/wiki/LoginState.php voor meer informatie

source: An error occured while trying to update the samlResponseId into the LoginState database. Review the saml log for more details
fr: Une erreur s'est produite lors de la tentative de mise à jour du samlResponseId dans la base de données LoginState. Consultez le journal saml pour plus de détails
nl_nl: Er is een fout opgetreden bij het bijwerken van de samlResponseId in de LoginState-database. Bekijk het saml-logboek voor meer details.

source: GLPI did not expect an assertion from this Idp. The most likely reason is a race condition causing an inconsistant loginState in the database or software bug. Please login again via the GLPI-interface. Sorry for the inconvenience. See: https://codeberg.org/QuinQuies/glpisaml/wiki/LoginState.php for more information
fr: GLPI ne s'attendait pas à une affirmation de cet IdP. La raison la plus probable est une situation de concurrence critique provoquant un état de connexion incohérent dans la base de données ou un bug logiciel. Veuillez vous reconnecter via l'interface GLPI. Désolé pour le dérangement. Voir\ : https://codeberg.org/QuinQuies/glpisaml/wiki/LoginState.php pour plus d'informations
nl_nl: GLPI verwachtte geen SAML reactie van deze Idp. De meest waarschijnlijke reden hiervoor is dat er een raceconditie is ontstaan die een inconsistente loginState in de database of een softwarefout veroorzaakt. Log opnieuw in via de GLPI-interface. Sorry voor het ongemak. Zie: https://codeberg.org/QuinQuies/glpisaml/wiki/LoginState.php voor meer informatie

source: An error occured while trying to update the login phase to LoginState::PHASE_SAML_AUTH into the LoginState database. Review the saml log for more details
fr: Une erreur s'est produite lors de la tentative de mise à jour de la phase de connexion vers LoginState\:\:PHASE_SAML_AUTH dans la base de données LoginState. Consultez le journal saml pour plus de détails
nl_nl: Er is een fout opgetreden bij het bijwerken van de aanmeldingsfase naar LoginState::PHASE_SAML_AUTH in de LoginState-database. Bekijk het saml-logboek voor meer details

source: Validation of the samlResponse document failed. Review the saml log for more details
fr: La validation du document samlResponse a échoué. Consultez le journal saml pour plus de détails
nl_nl: Validatie van het samlResponse-document is mislukt. Bekijk het saml-logboek voor meer details

source: Your SSO login was successful but we where not able to fetch the loginState from the database and could not continue to log you into GLPI.
fr: Votre connexion SSO a réussi mais nous n'avons pas pu récupérer le loginState de la base de données et nous n'avons pas pu continuer à vous connecter à GLPI.
nl_nl: Uw SSO-login was succesvol, maar we konden de loginState niet uit de database ophalen en konden u niet blijven aanmelden bij GLPI.
