Repository: DonutsNL/glpisaml
Catalog: locales/*.po
Languages: fr, nl_nl

source: Your SSO login was successful but there is no matching GLPI user account and we failed to create one dynamically using Just In Time user creation. Please request a GLPI administrator to review the logs and correct the problem or request the administrator to create a GLPI user manually.
fr: Votre connexion SSO a réussi mais il n'existe aucun compte utilisateur GLPI correspondant et nous n'avons pas réussi à en créer un de manière dynamique en utilisant la création d'utilisateurs Just In Time. Veuillez demander à un administrateur GLPI d'examiner les journaux et de corriger le problème ou demander à l'administrateur de créer manuellement un utilisateur GLPI.
nl_nl: Uw SSO-aanmelding was succesvol, maar er is geen overeenkomend GLPI-gebruikersaccount en het is ons niet gelukt om dynamisch een nieuw account aan te maken met behulp van Just In Time-gebruikerscreatie. Vraag een GLPI-beheerder om de logbestanden te bekijken en het probleem te corrigeren, of vraag de beheerder om handmatig een GLPI-gebruiker voor u aan te maken.

source: User with GlpiUserid:
fr: Utilisateur avec GlpiUserid\ :
nl_nl: Gebruiker met GlpiUserid:

source: GLPI SAML was not able to assign the correct permissions to your user. Please let an Administrator review them before using GLPI.
fr: GLPI SAML n'a pas pu attribuer les bonnes autorisations à votre utilisateur. Veuillez laisser un administrateur les examiner avant d'utiliser GLPI.
nl_nl: GLPI SAML kon de juiste rechten niet aan uw gebruiker toewijzen. Laat een beheerder deze controleren voordat u GLPI gebruikt.

source: GLPI SAML was not able to assign the correct permissions to your user. Please let an Administrator review the user before using GLPI.
fr: GLPI SAML n'a pas pu attribuer les bonnes autorisations à votre utilisateur. Veuillez laisser un administrateur examiner l'utilisateur avant d'utiliser GLPI.
nl_nl: GLPI SAML kon de juiste rechten niet aan uw gebruiker toewijzen. Laat een beheerder de gebruiker beoordelen voordat u GLPI gebruikt.

source: GLPI SAML was not able to update the user defaults. Please let an administrator review the user before using GLPI.
fr: GLPI SAML n'a pas pu mettre à jour les paramètres par défaut de l'utilisateur. Veuillez laisser un administrateur examiner l'utilisateur avant d'utiliser GLPI.
nl_nl: GLPI SAML kon de standaardinstellingen van de gebruiker niet bijwerken. Laat een beheerder de gebruiker beoordelen voordat u GLPI gebruikt.

source: NameId attribute is missing in samlResponse
fr: L'attribut NameId est manquant dans samlResponse
nl_nl: Het NameId-kenmerk ontbreekt in samlResponse

source: Detected a default guest user in samlResponse, this is not supported<br> by glpiSAML. Please create a dedicated account for this user owned by your tenant/identity provider.<br> Also see: https://learn.microsoft.com/en-us/azure/active-directory/develop/saml-claims-customization
fr: Détection d'un utilisateur invité par défaut dans samlResponse, ceci n'est pas pris en charge<br> par glpiSAML. Veuillez créer un compte dédié pour cet utilisateur appartenant à votre locataire/fournisseur d'identité.<br> Voir également\ : https://learn.microsoft.com/en-us/azure/active-directory/develop/saml-claims-customization'
nl_nl: Er is een standaard gastgebruiker gedetecteerd in samlResponse, dit wordt niet ondersteund door glpiSAML. Maak een speciaal account voor deze gebruiker, eigendom van uw tenant/identiteitsprovider. Zie ook: https://learn.microsoft.com/en-us/azure/active-directory/develop/saml-claims- maatwerk

source: SamlResponse should have at least 1 valid email address for GLPI to find the corresponding GLPI user or create it (with JIT enabled). For this purpose make sure either the IDP provided NameId property is populated with the email address format, or configure the IDP to add the users email address in the samlResponse claims using the designated schema property key:
fr: SamlResponse doit avoir au moins 1 adresse e-mail valide pour que GLPI puisse trouver l'utilisateur GLPI correspondant ou le créer (avec JIT activé). À cette fin, assurez-vous que la propriété NameId fournie par l'IDP est renseignée avec le format d'adresse e-mail, ou configurez l'IDP pour ajouter l'adresse e-mail de l'utilisateur dans les revendications samlResponse à l'aide de la clé de propriété de schéma désignée :
nl_nl: SamlResponse moet minimaal 1 geldig e-mailadres hebben zodat GLPI de corresponderende GLPI-gebruiker kan vinden of aanmaken (met JIT ingeschakeld). Zorg er voor dit doel voor dat de door de IDP opgegeven NameId-eigenschap is gevuld met de e-mailadresnotatie, of configureer de IDP om het e-mailadres van de gebruiker toe te voegen aan de samlResponse-claims met behulp van de aangewezen schema-eigenschap sleutel:
